In [2]:
import pandas as pd
import numpy as np 
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [6]:
simpleData = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])
simpleData

    a   b   c   d
0  41  34  82  91
1  22  72  39  50
2  52  16  84  12
3   2  26  75  84

In [ ]:
simpleData.to_sql(name='new_table',con=temp_db,index=False)

In [13]:
temp_db

Engine(sqlite:///:memory:)

In [15]:
# read from db 
# read from entire table 
new_df = pd.read_sql(sql='new_table',con=temp_db)
new_df

   index   a   b   c   d
0      0  41  34  82  91
1      1  22  72  39  50
2      2  52  16  84  12
3      3   2  26  75  84

In [22]:
# new_df = pd.to_sql('./data/db.sql',con=temp_db)
select = pd.read_sql(sql='SELECT a,c FROM new_table  ',con=temp_db)
select

    a   c
0  41  82
1  22  39
2  52  84
3   2  75